<?php
$web['area'] = array (
  96 => 
  array (
    0 => '留言交流',
    10 => '意见建议',
    20 => '挑错本站',
    30 => '友情链接',
    40 => '广告申请',
    50 => '网站提交',
    60 => '给管理员留言',
    70 => '公告',
  ),
  100 => 
  array (
    0 => '站长研讨',
    10 => '建站技术',
    20 => '网赚交流',
    30 => '搜索引擎优化',
    40 => '资源交流交易',
  ),
  101 => 
  array (
    0 => '162100源码资源区',
    10 => '网址导航系统',
    20 => '简约论坛系统',
    30 => '分类信息系统',
    40 => '天气预报',
    50 => '留言帖吧',
    60 => '静态(论坛/文章)系统',
    70 => '文本数据库动态论坛',
    80 => 'HTML编辑器',
  ),
);
?>