<?php
$_MEDALDB=array(
	'1' => array(
		'id' => '1',
		'name' => '终身成就奖',
		'intro' => '谢谢您为社区发展做出的不可磨灭的贡献!!',
		'picurl' => '1.gif',
	),
	'2' => array(
		'id' => '2',
		'name' => '优秀斑竹奖',
		'intro' => '辛劳地为论坛付出劳动，收获快乐，感谢您!',
		'picurl' => '2.gif',
	),
	'3' => array(
		'id' => '3',
		'name' => '宣传大使奖',
		'intro' => '谢谢您为社区积极宣传,特颁发此奖!',
		'picurl' => '3.gif',
	),
	'4' => array(
		'id' => '4',
		'name' => '特殊贡献奖',
		'intro' => '您为论坛做出了特殊贡献,谢谢您!',
		'picurl' => '4.gif',
	),
	'5' => array(
		'id' => '5',
		'name' => '金点子奖',
		'intro' => '为社区提出建设性的建议被采纳,特颁发此奖!',
		'picurl' => '5.gif',
	),
	'6' => array(
		'id' => '6',
		'name' => '原创先锋奖',
		'intro' => '谢谢您积极发表原创作品,特颁发此奖!',
		'picurl' => '6.gif',
	),
	'7' => array(
		'id' => '7',
		'name' => '贴图大师奖',
		'intro' => '帖图高手,堪称大师!',
		'picurl' => '7.gif',
	),
	'8' => array(
		'id' => '8',
		'name' => '灌水天才奖',
		'intro' => '能够长期提供优质的社区水资源者,可得这个奖章!',
		'picurl' => '8.gif',
	),
	'9' => array(
		'id' => '9',
		'name' => '新人进步奖',
		'intro' => '新人有很大的进步可以得到这个奖章!',
		'picurl' => '9.gif',
	),
	'10' => array(
		'id' => '10',
		'name' => '幽默大师奖',
		'intro' => '您总是能给别人带来欢乐,谢谢您!',
		'picurl' => '10.gif',
	),
);
?>