<?php
/**
 * PHPB2B cache file, DO NOT change me!
 * Created: Sep 9, 2010, 14:39
 * Id: db550bba5dfa134414cf0d8577103f28
 */

$_PB_CACHE['offer_expire'] = array (
  10 => '10天',
  30 => '一个月',
  90 => '三个月',
  180 => '六个月',
);

$_PB_CACHE['manage_type'] = array (
  1 => '生产型',
  2 => '贸易型',
  3 => '服务型',
  4 => '政府或其他机构',
);

$_PB_CACHE['main_market'] = array (
  1 => '大陆',
  2 => '港澳台',
  3 => '北美',
  4 => '南美',
  5 => '欧洲',
  6 => '亚洲',
  7 => '非洲',
  8 => '大洋洲',
  9 => '其他市场',
);

$_PB_CACHE['reg_fund'] = array (
  0 => '不公开',
  1 => '人民币10万元以下',
  2 => '人民币10-30万',
  3 => '人民币30-50万',
  4 => '人民币50-100万',
  5 => '人民币100-300万',
  6 => '人民币300-500万',
  7 => '人民币500-1000万',
  8 => '人民币1000-5000万',
  9 => '人民币5000万以上',
  10 => '其他',
);

$_PB_CACHE['year_annual'] = array (
  1 => '人民币10万以下/年',
  2 => '人民币10-30万/年',
  3 => '人民币30-50万/年',
  4 => '人民币50-100万/年',
  5 => '人民币100-300万/年',
  6 => '人民币300-500万/年',
  7 => '人民币500-1000万/年',
  8 => '人民币1000-5000万/年',
  9 => '人民币5000万以上/年',
  10 => '其他',
);

$_PB_CACHE['economic_type'] = array (
  1 => '国有企业',
  2 => '集体企业',
  3 => '股份合作企业',
  4 => '联营企业',
  5 => '有限责任公司',
  6 => '股份有限公司',
  7 => '私营企业',
  8 => '个人独资企业',
  9 => '非盈利组织',
  10 => '其他',
  0 => '不选择',
);

$_PB_CACHE['check_status'] = array (
  0 => '无效',
  1 => '有效',
  2 => '等待审核',
  3 => '审核不通过',
);

$_PB_CACHE['employee_amount'] = array (
  1 => '5人以下',
  2 => '5-10人',
  3 => '11-50人',
  4 => '51-100人',
  5 => '101-500人',
  6 => '501-1000人',
  7 => '1000人以上',
);

$_PB_CACHE['common_status'] = array (
  0 => '无效',
  1 => '有效',
);

$_PB_CACHE['service_type'] = array (
  1 => '咨询',
  2 => '建议',
  3 => '投诉',
);

$_PB_CACHE['education'] = array (
  0 => '其他',
  -1 => '不要求',
  -2 => '不限',
  1 => '博士',
  2 => '硕士',
  3 => '本科',
  4 => '大专',
  5 => '中专',
  6 => '技校',
  7 => '高中',
  8 => '初中',
  9 => '小学',
);

$_PB_CACHE['salary'] = array (
  0 => '不选择',
  -1 => '面议',
  1 => '1500以下',
  2 => '1500-1999元/月',
  3 => '2000-2999元/月',
  4 => '3000-4999元/月',
  5 => '5000以上',
);

$_PB_CACHE['work_type'] = array (
  0 => '不选择',
  1 => '全职',
  2 => '兼职',
  3 => '临时',
  4 => '实习',
  5 => '其他',
);

$_PB_CACHE['position'] = array (
  0 => '不选择',
  1 => '董事长、总裁及副职，企业主、企业合伙人，总经理/副总经理',
  2 => '行政部门经理/行政人员',
  3 => '技术部门经理/技术人员',
  4 => '生产部门经理/生产人员',
  5 => '市场部门经理/市场人员',
  6 => '采购部门经理/采购人员',
  7 => '销售部门经理/销售人员',
  8 => '其他',
);

$_PB_CACHE['gender'] = array (
  0 => '不选择',
  1 => '男',
  2 => '女',
  -1 => '不限',
);

$_PB_CACHE['phone_type'] = array (
  1 => '移动电话',
  2 => '住宅电话',
  3 => '商务电话',
  4 => '其他',
  0 => '不选择',
);

$_PB_CACHE['im_type'] = array (
  1 => 'QQ',
  2 => 'ICQ',
  3 => 'MSN Messenger',
  4 => 'Yahoo Messenger',
  5 => 'Skype',
  6 => '其他',
  0 => '不选择',
);

$_PB_CACHE['common_option'] = array (
  0 => '否',
  1 => '是',
);

$_PB_CACHE['calls'] = array (
  1 => '先生',
  2 => '女士',
);

$_PB_CACHE['measuring'] = array (
  1 => '个',
  2 => '件',
);

$_PB_CACHE['monetary'] = array (
  1 => '元',
  3 => '美元',
  2 => '万元',
);

$_PB_CACHE['price_type'] = array (
  1 => '买',
  2 => '卖',
);

$_PB_CACHE['price_trends'] = array (
  1 => '升',
  2 => '稳',
  3 => '降',
  4 => '不确定',
);


?>