//北京市
var cityCodes110000 = "110100,110200";
var cityNames110000 = "市辖区,县";

//天津市
var cityCodes120000 = "120100,120200";
var cityNames120000 = "市辖区,县";

//河北省
var cityCodes130000 = "130100,130200,130300,130400,130500,130600,130700,130800,130900,131000,131100";
var cityNames130000 = "石家庄市,唐山市,秦皇岛市,邯郸市,邢台市,保定市,张家口市,承德市,沧州市,廊坊市,衡水市";

//山西省
var cityCodes140000 = "140100,140200,140300,140400,140500,140600,140700,140800,140900,141000,141100";
var cityNames140000 = "太原市,大同市,阳泉市,长治市,晋城市,朔州市,晋中市,运城市,忻州市,临汾市,吕梁市";

//内蒙古自治区
var cityCodes150000 = "150100,150200,150300,150400,150500,150600,150700,150800,150900,152200,152500,152600,152900";
var cityNames150000 = "呼和浩特市,包头市,乌海市,赤峰市,通辽市,鄂尔多斯市,呼伦贝尔市,巴彦淖尔市,乌兰察布市,兴安盟,锡林郭勒盟,乌兰察布盟,阿拉善盟";

//辽宁省
var cityCodes210000 = "210100,210200,210300,210400,210500,210600,210700,210800,210900,211000,211100,211200,211300,211400";
var cityNames210000 = "沈阳市,大连市,鞍山市,抚顺市,本溪市,丹东市,锦州市,营口市,阜新市,辽阳市,盘锦市,铁岭市,朝阳市,葫芦岛市";

//吉林省
var cityCodes220000 = "220100,220200,220300,220400,220500,220600,220700,220800,222400";
var cityNames220000 = "长春市,吉林市,四平市,辽源市,通化市,白山市,松原市,白城市,延边朝鲜族自治州";

//黑龙江省
var cityCodes230000 = "230100,230200,230300,230400,230500,230600,230700,230800,230900,231000,231100,231200,232700";
var cityNames230000 = "哈尔滨市,齐齐哈尔市,鸡西市,鹤岗市,双鸭山市,大庆市,伊春市,佳木斯市,七台河市,牡丹江市,黑河市,绥化市,大兴安岭地区";

//上海市
var cityCodes310000 = "310100,310200";
var cityNames310000 = "市辖区,县";

//江苏省
var cityCodes320000 = "320100,320200,320300,320400,320500,320600,320700,320800,320900,321000,321100,321200,321300";
var cityNames320000 = "南京市,无锡市,徐州市,常州市,苏州市,南通市,连云港市,淮安市,盐城市,扬州市,镇江市,泰州市,宿迁市";

//浙江省
var cityCodes330000 = "330100,330200,330300,330400,330500,330600,330700,330800,330900,331000,331100";
var cityNames330000 = "杭州市,宁波市,温州市,嘉兴市,湖州市,绍兴市,金华市,衢州市,舟山市,台州市,丽水市";

//安徽省
var cityCodes340000 = "340100,340200,340300,340400,340500,340600,340700,340800,341000,341100,341200,341300,341400,341500,341600,341700,341800";
var cityNames340000 = "合肥市,芜湖市,蚌埠市,淮南市,马鞍山市,淮北市,铜陵市,安庆市,黄山市,滁州市,阜阳市,宿州市,巢湖市,六安市,亳州市,池州市,宣城市";

//福建省
var cityCodes350000 = "350100,350200,350300,350400,350500,350600,350700,350800,350900";
var cityNames350000 = "福州市,厦门市,莆田市,三明市,泉州市,漳州市,南平市,龙岩市,宁德市";

//江西省
var cityCodes360000 = "360100,360200,360300,360400,360500,360600,360700,360800,360900,361000,361100";
var cityNames360000 = "南昌市,景德镇市,萍乡市,九江市,新余市,鹰潭市,赣州市,吉安市,宜春市,抚州市,上饶市";

//山东省
var cityCodes370000 = "370100,370200,370300,370400,370500,370600,370700,370800,370900,371000,371100,371200,371300,371400,371500,371600,371700";
var cityNames370000 = "济南市,青岛市,淄博市,枣庄市,东营市,烟台市,潍坊市,济宁市,泰安市,威海市,日照市,莱芜市,临沂市,德州市,聊城市,滨州市,荷泽市";

//河南省
var cityCodes410000 = "410100,410200,410300,410400,410500,410600,410700,410800,410900,411000,411100,411200,411300,411400,411500,411600,411700";
var cityNames410000 = "郑州市,开封市,洛阳市,平顶山市,安阳市,鹤壁市,新乡市,焦作市,濮阳市,许昌市,漯河市,三门峡市,南阳市,商丘市,信阳市,周口市,驻马店市";

//湖北省
var cityCodes420000 = "420100,420200,420300,420500,420600,420700,420800,420900,421000,421100,421200,421300,422800,429000";
var cityNames420000 = "武汉市,黄石市,十堰市,宜昌市,襄樊市,鄂州市,荆门市,孝感市,荆州市,黄冈市,咸宁市,随州市,恩施土家族苗族自治州,省直辖行政单位";

//湖南省
var cityCodes430000 = "430100,430200,430300,430400,430500,430600,430700,430800,430900,431000,431100,431200,431300,433100";
var cityNames430000 = "长沙市,株洲市,湘潭市,衡阳市,邵阳市,岳阳市,常德市,张家界市,益阳市,郴州市,永州市,怀化市,娄底市,湘西土家族苗族自治州";

//广东省
var cityCodes440000 = "440100,440200,440300,440400,440500,440600,440700,440800,440900,441200,441300,441400,441500,441600,441700,441800,441900,442000,445100,445200,445300";
var cityNames440000 = "广州市,韶关市,深圳市,珠海市,汕头市,佛山市,江门市,湛江市,茂名市,肇庆市,惠州市,梅州市,汕尾市,河源市,阳江市,清远市,东莞市,中山市,潮州市,揭阳市,云浮市";

//广西壮族自治区
var cityCodes450000 = "450100,450200,450300,450400,450500,450600,450700,450800,450900,451000,451100,451200,451300,451400";
var cityNames450000 = "南宁市,柳州市,桂林市,梧州市,北海市,防城港市,钦州市,贵港市,玉林市,百色市,贺州市,河池市,来宾市,崇左市";

//海南省
var cityCodes460000 = "460100,460200,469000";
var cityNames460000 = "海口市,三亚市,省直辖县级行政单位";

//重庆市
var cityCodes500000 = "500100,500200,500300";
var cityNames500000 = "市辖区,县,市";

//四川省
var cityCodes510000 = "510100,510300,510400,510500,510600,510700,510800,510900,511000,511100,511300,511400,511500,511600,511700,511800,511900,512000,513200,513300,513400";
var cityNames510000 = "成都市,自贡市,攀枝花市,泸州市,德阳市,绵阳市,广元市,遂宁市,内江市,乐山市,南充市,眉山市,宜宾市,广安市,达州市,雅安市,巴中市,资阳市,阿坝藏族羌族自治州,甘孜藏族自治州,凉山彝族自治州";

//贵州省
var cityCodes520000 = "520100,520200,520300,520400,522200,522300,522400,522600,522700";
var cityNames520000 = "贵阳市,六盘水市,遵义市,安顺市,铜仁地区,黔西南布依族苗族自治州,毕节地区,黔东南苗族侗族自治州,黔南布依族苗族自治州";

//云南省
var cityCodes530000 = "530100,530300,530400,530500,530600,530700,530800,530900,532300,532500,532600,532800,532900,533100,533300,533400";
var cityNames530000 = "昆明市,曲靖市,玉溪市,保山市,昭通市,丽江市,思茅市,临沧市,楚雄彝族自治州,红河哈尼族彝族自治州,文山壮族苗族自治州,西双版纳傣族自治州,大理白族自治州,德宏傣族景颇族自治州,怒江傈僳族自治州,迪庆藏族自治州";

//西藏自治区
var cityCodes540000 = "540100,542100,542200,542300,542400,542500,542600";
var cityNames540000 = "拉萨市,昌都地区,山南地区,日喀则地区,那曲地区,阿里地区,林芝地区";

//陕西省
var cityCodes610000 = "610100,610200,610300,610400,610500,610600,610700,610800,610900,611000";
var cityNames610000 = "西安市,铜川市,宝鸡市,咸阳市,渭南市,延安市,汉中市,榆林市,安康市,商洛市";

//甘肃省
var cityCodes620000 = "620100,620200,620300,620400,620500,620600,620700,620800,620900,621000,621100,622600,622900,623000";
var cityNames620000 = "兰州市,嘉峪关市,金昌市,白银市,天水市,武威市,张掖市,平凉市,酒泉市,庆阳市,定西市,陇南地区,临夏回族自治州,甘南藏族自治州";

//青海省
var cityCodes630000 = "630100,632100,632200,632300,632500,632600,632700,632800";
var cityNames630000 = "西宁市,海东地区,海北藏族自治州,黄南藏族自治州,海南藏族自治州,果洛藏族自治州,玉树藏族自治州,海西蒙古族藏族自治州";

//宁夏回族自治区
var cityCodes640000 = "640100,640200,640300,640400,640500";
var cityNames640000 = "银川市,石嘴山市,吴忠市,固原市,中卫市";

//新疆维吾尔自治区
var cityCodes650000 = "650100,650200,652100,652200,652300,652700,652800,652900,653000,653100,653200,654000,654200,654300,659000";
var cityNames650000 = "乌鲁木齐市,克拉玛依市,吐鲁番地区,哈密地区,昌吉回族自治州,博尔塔拉蒙古自治州,巴音郭楞蒙古自治州,阿克苏地区,克孜勒苏柯尔克孜自治州,喀什地区,和田地区,伊犁哈萨克自治州,塔城地区,阿勒泰地区,省直辖行政单位";

//台湾省
var cityCodes710000 = "710000";
var cityNames710000 = "台湾省";

//香港特别行政区
var cityCodes810000 = "810000";
var cityNames810000 = "香港特别行政区";

//澳门特别行政区
var cityCodes820000 = "820000";
var cityNames820000 = "澳门特别行政区";


/**********************************************
/*
/* 根据城市的编码取得城市的名称。
/* 如果城市的编码不存在返回空的字符串。
/*
/* Author: Alan Liu(刘新福)
/* Created on 2003-12-07
/**********************************************/
function getCityNameByCode(code)
{
    if(code.length == 0)
    {
        return "";
    }
    
	var name = "";
	var provinceCode = code.substr(0, 2) + "0000";
	var cityCodeList = eval("cityCodes" + provinceCode + ".split(',')");
	var cityNameList = eval("cityNames" + provinceCode + ".split(',')");

	for(var i = 0; i < cityCodeList.length; i++)
	{
		if(code == cityCodeList[i])
		{
			name = cityNameList[i];
			break;
		}
	}
	return name;
}

/********************************************************
/*
/* 初始化城市下拉列表。
/*
/* @province     要初始化的HTML页面的<select>元素。
/* @initValue    该<select>元素的初始显示的<option>。
/* @provinceCode 要显示的城市所在的省份编码。
/*
/* Author: Alan Liu(刘新福)
/* Created on 2003-12-07
/*******************************************************/
function initCity(city, initValue, provinceCode, type)
{
	var count = city.options.length;
	for(var i = 0; i < count; i++)
	{
		city.remove(0);
	}
    
    if(provinceCode == "-1")
    {
        city.options[city.options.length] = new Option ("-请选择(市)-", "-1");
        return;
    }
    
    if(provinceCode == "0")
    {
        city.options[city.options.length] = new Option ("-不限-", "0");
        return;
    }
    
	var cityCodeList = eval("cityCodes" + provinceCode + ".split(',')");
	var cityNameList = eval("cityNames" + provinceCode + ".split(',')");

    if(type == "1")
    {
        city.options[city.options.length] = new Option ("-请选择(市)-", "-1");
    }else
    {
        city.options[city.options.length] = new Option ("-不限-", "0");
    }
    
	for(var i = 0; i < cityCodeList.length; i++)
	{
		var option = new Option ( cityNameList[i],cityCodeList[i]);
		city.options[city.options.length] = option;
		
		if(cityCodeList[i] == initValue)
		{
			option.selected = true;
		}
	}
}
